#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

data.aws_availability_zones.available: Reading...
module.test-k.aws_iam_role.app_runner_instance_role: Refreshing state... [id=katest-prod-instance-role]
module.test-k.aws_iam_role.app_runner_service_role: Refreshing state... [id=katest-prod-service-role]
module.ecr.aws_ecr_repository.repositories["katest-prod"]: Refreshing state... [id=katest-prod]
module.test-k.aws_apprunner_auto_scaling_configuration_version.app_scaling: Refreshing state... [id=arn:aws:apprunner:us-west-2:877140918814:autoscalingconfiguration/katest-prod/1/49bfd84a656a411982dc8e53a22d3424]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0426b2105320c009c]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-2]
module.ecr.aws_ecr_lifecycle_policy.policy["katest-prod"]: Refreshing state... [id=katest-prod]
module.test-k.aws_iam_role_policy_attachment.app_runner_service_role_policy: Refreshing state... [id=katest-prod-service-role-20251215225843339600000001]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-02c71295d4fb38da1]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-008ea410241f12728]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-04adc1bbc4e468d43]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0cc0d18a75d0a7be3]
aws_security_group.app_runner_vpc: Refreshing state... [id=sg-0e59940eec5394fd9]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-04869d541d946212d]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-06b31581042c3a5e2]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-065143194fe4d2b67]
module.test-k.aws_apprunner_vpc_connector.connector[0]: Refreshing state... [id=arn:aws:apprunner:us-west-2:877140918814:vpcconnector/katest-prod-vpc-connector/1/84788d131d0a49b393255061a25b4aa8]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-076420b73cb513a92]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b170633d2827c556]
module.vpc.aws_nat_gateway.main[0]: Refreshing state... [id=nat-0b825c4d151088062]
module.test-k.aws_apprunner_service.service: Refreshing state... [id=arn:aws:apprunner:us-west-2:877140918814:service/katest-prod/c44a79e154a44b7fa437d20a74c22a2c]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0356b899b56805565]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-08eb15112c3b77ecc]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-057e45fd8be606b9f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.test-k.aws_apprunner_custom_domain_association.core_custom_domain[0] will be created
  + resource "aws_apprunner_custom_domain_association" "core_custom_domain" {
      + certificate_validation_records = (known after apply)
      + dns_target                     = (known after apply)
      + domain_name                    = "test.elosos.xyz"
      + enable_www_subdomain           = false
      + id                             = (known after apply)
      + service_arn                    = "arn:aws:apprunner:us-west-2:877140918814:service/katest-prod/c44a79e154a44b7fa437d20a74c22a2c"
      + status                         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @osstorres, Action: `pull_request`*